content/pharmacology.org
#+STARTUP: overview
#+title: MU-Sofia | Pharmacology Documentation
#+author: Thanos Apollo
#+description: Personal notes of Pharmacology, according to the syllabus of MU-Sofia 
# #+SETUPFILE: themes/org/theme-readtheorg.setup
#+export_file_name: ../public/Pharmacology.html
#+OPTIONS: num:nil ^:{} date:nil timestamp:nil creator:t
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* [[https://thanosapollo.com][Home Page]]
* GENERAL PHARMACOLOGY
** 1. Object and branches of pharmacology. Connection with other sciences. Historical review. Sourses of drugs.
*** Object and branches of pharmacology
Pharmacology is the study of drugs and their effects on living organisms. It is a branch of biomedical science that deals with the discovery, development, and evaluation of drugs and their therapeutic uses.
There are two main branches of pharmacology: *pharmacokinetics* and *pharmacodynamics*

+ Pharmacokinetics deals with the absorption, distribution, metabolism, and excretion of drugs in the body.
  + This includes the study of how drugs are absorbed into the bloodstream, how they are distributed to various organs and tissues, how they are metabolized or broken down, and how they are eliminated from the body.

+ Pharmacodynamics, on the other hand, deals with the effects of drugs on the body
  + This includes their mechanisms of action, therapeutic and toxic effects, and interactions with other drugs and with physiological systems.
*** Connetion with other sciences
Pharmacology is closely connected with other sciences such as chemistry, biochemistry, physiology, and pathology.
+ Chemists are involved in the discovery and synthesis of new drugs, while biochemists study the biochemical mechanisms of drug action.
+ Physiologists study the effects of drugs on the body, while pathologists study the effects of diseases on the body and how drugs can be used to treat them.
*** Historical review
+ The history of pharmacology can be traced back to ancient times, when people used natural remedies such as herbs and plants to treat illnesses.
+ The ancient Egyptians, Greeks, and Chinese all developed their own systems of medicine based on natural remedies.
