Pharmacology.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MU-Sofia | Pharmacology Documentation</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="Personal notes of Pharmacology, according to the syllabus of MU-Sofia"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MU-Sofia | Pharmacology Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f26c3c">Home Page</a></li>
<li><a href="#org5781be0">GENERAL PHARMACOLOGY</a>
<ul>
<li><a href="#org5942ef5">1. Object and branches of pharmacology. Connection with other sciences. Historical review. Sourses of drugs.</a>
<ul>
<li><a href="#orgc6f7ec2">Object and branches of pharmacology</a></li>
<li><a href="#org56a29bc">Connetion with other sciences</a></li>
<li><a href="#org0af816d">Historical review</a></li>
<li><a href="#org2e8f329">Sources of drugs</a></li>
<li><a href="#orgaad18a8">Summary</a></li>
</ul>
</li>
<li><a href="#org54b5c31">2. Drug - definition, origin, nomenclature. Drug form and drug product - definition. Drug preparations.</a>
<ul>
<li><a href="#org79f2def">Defintion, origin and nomenclature</a></li>
<li><a href="#orge7622a5">Drug form and drug product</a></li>
<li><a href="#org832b61c">Drug preparations</a></li>
<li><a href="#org7c6b6c9">Summary</a></li>
</ul>
</li>
<li><a href="#orgf547a6d">3. Drug development - stages and phases.</a>
<ul>
<li><a href="#orgbdc3845">Summary</a></li>
</ul>
</li>
<li><a href="#orgadeba1d">4. Transmembrane transport of drugs.</a></li>
<li><a href="#org817c013">5. Drug absorption after various routes of administration.</a>
<ul>
<li><a href="#org0370b84">Summary</a></li>
</ul>
</li>
<li><a href="#org905fa94">6. Drug distribution.</a>
<ul>
<li><a href="#org897bae5">Summary</a></li>
</ul>
</li>
<li><a href="#orge0687ba">7. Drug metabolism.</a>
<ul>
<li><a href="#org072191a">Summary</a></li>
</ul>
</li>
<li><a href="#org80dc785">8. Drug excretion.</a>
<ul>
<li><a href="#orgbf6bdfd">Summary</a></li>
</ul>
</li>
<li><a href="#orgd40ade6">9. Specific and non-specific type of drug action. Types of receptors.</a>
<ul>
<li><a href="#org31641f4">Summary</a></li>
</ul>
</li>
<li><a href="#org17fb6d0">10. Characteristics of the receptor action of the drugs.</a></li>
<li><a href="#org9c68cb7">11. Drug properties and environmental factors affecting drug pharmacokinetics and drug pharmacodynamics.</a></li>
<li><a href="#org6261c48">12. Factors from the human body affecting the drug pharmacokinetics and drug pharmacodynamics.</a></li>
<li><a href="#org2c99b70">13. Effects occurring after repeated drug administration.</a></li>
<li><a href="#org338d0c4">14. Drug interactions at a pharmacokinetic level.</a></li>
<li><a href="#orgd286bd2">15. Drug interactions at a pharmacodynamic level.</a></li>
<li><a href="#orga71f315">16. Pharmaceutical drug interactions (drug incompatibility).   Drugs affecting clinical  laboratory tests. Interactions of drugs with foods.</a></li>
</ul>
</li>
<li><a href="#orge53e39c"><span class="todo TODO">TODO</span> PHARMACOLOGY OF ORGAN SYSTEMS</a>
<ul>
<li><a href="#org2507c2b">17. Pharmacological modulation of the cholinergic   ** neurotransmission – levels and</a></li>
<li><a href="#org88c6ecf">mechanisms.</a></li>
<li><a href="#orgc436642">18. Cholinergic drugs (cholinomimetics).</a></li>
<li><a href="#org4efe15c">19. Antimuscarinic drugs (M-cholinolytics).</a></li>
<li><a href="#orgddccb0e">20. Neuromuscular blockers (Peripheral muscle relaxants).</a></li>
<li><a href="#org103b9b9">21. Pharmacological modulation of the adrenergic   ** neurotransmission – levels and</a></li>
<li><a href="#org4d9b08f">mechanisms.</a></li>
<li><a href="#orgd8685e5">22. Adrenomimetics.</a></li>
<li><a href="#org9e3c67a">23. Alpha-adrenergic blocking agents. Agonists of the  ** central presynaptic α2a-adrenergic</a></li>
<li><a href="#org41475b0">receptors.</a></li>
<li><a href="#org2cc8ce5">24. Beta-adrenergic blocking agents.</a></li>
<li><a href="#orgf0ebaac">25. Histamine antagonists.</a></li>
<li><a href="#org869faef">26. Serotonin agonists and antiserotoninergic drugs.</a></li>
<li><a href="#orgc6474eb">27. Local anaesthetics.</a></li>
<li><a href="#orgf636c94">28. General anaesthetics.</a></li>
<li><a href="#orgf57e60e">29. Hypnotics. Sedative drugs with plant origin.</a></li>
<li><a href="#org39df9c5">30. Antiepileptic drugs.</a></li>
<li><a href="#org1dd1531">31. Antiparkinsonian drugs.</a></li>
<li><a href="#orgf880b95">32. Neuroleptics.</a></li>
<li><a href="#org50ace7a">33. Anxiolytics. Muscle relaxants with central action.</a></li>
<li><a href="#org023be74">34. Antidepressants. Antimanic drugs.</a></li>
<li><a href="#org1600b84">35. Psychostimulants. Nootropic drugs.</a></li>
<li><a href="#orgc33f7ef">36. Opioid analgesics.</a></li>
<li><a href="#orgb6f6cb2">37. Nonsteroidal anti-inflammatory drugs. Non-opioid  ** analgesics.</a></li>
<li><a href="#org0a0f0a8">38. Calcium channel blockers.</a></li>
<li><a href="#org09e520e">39. Drugs that affect the renin-angiotensin-aldosterone ** system.</a></li>
<li><a href="#org0464004">40. Antihypertensive drugs.</a></li>
<li><a href="#orgc66ef62">41. Antiarrhythmic drugs.</a></li>
<li><a href="#org48d9b2c">42. Antianginal (antistenocardial) drugs.</a></li>
<li><a href="#org9e4444d">43. Drugs for the treatment of heart failure.</a></li>
<li><a href="#org823f97d">44. Diuretics.</a></li>
<li><a href="#org8a5b064">45. Peripheral vasodilators. Capillarotonic and venotonic  ** drugs.</a></li>
<li><a href="#org944a77e">46. Antimigraine drugs.</a></li>
<li><a href="#org71b6c1f">47. Antidyslipidemic drugs.</a></li>
<li><a href="#org9ccdb0b">48. Haematopoietic drugs.</a></li>
<li><a href="#org380fb47">49. Haemostatics (antiheamorrhagic) drugs.</a></li>
<li><a href="#org81a8025">50. Anticoagulants.</a></li>
<li><a href="#orgec71eab">51. Fibrinolytics. Antiplatelet drugs.</a></li>
<li><a href="#org0cee9ad">52. Antiasthmatic drugs.</a></li>
<li><a href="#org9f96e6c">53. Antitussive drugs.</a></li>
<li><a href="#org582acb0">54. Antiulcer drugs.</a></li>
<li><a href="#org15d3730">55. Antiemetic drugs.</a></li>
<li><a href="#orgf774cc5">56. Hepatoprotectors. Drugs that affect bile secretion.  ** Pancreatic enzyme preparations.</a></li>
<li><a href="#orgb6eb73b">57. Laxative drugs.</a></li>
<li><a href="#orgced6ed5">58. Antidiarrheal drugs.</a></li>
<li><a href="#org1d48382">59. Vitamins – clinical applications.</a></li>
<li><a href="#org0404197">60. Drugs that affect calcium and phosphorus exchange.  ** Antigout drugs.</a></li>
<li><a href="#orgea77393">61. Hypothalamic and pituitary hormones – drugs and clinical  application.</a></li>
<li><a href="#org1407194">62. Thyreoactive drugs.</a></li>
<li><a href="#org2d13271">63. Insulins and insulin analogues.</a></li>
<li><a href="#org5c16804">64. Oral antidiabetic drugs.</a></li>
<li><a href="#org2a979fa">65. Glucocorticoids and mineralcorticoids.</a></li>
<li><a href="#org892957d">66. Female sex hormones – drugs and clinical application.  ** Hormonal contraceptives.</a></li>
<li><a href="#org9cfee68">67. Male sex hormones – drugs and clinical application.  ** Anabolic drugs. Drugs for the</a></li>
<li><a href="#org6c65166">treatment of erectile dysfunction.</a></li>
<li><a href="#org9da502d">68. Uteroactive drugs.</a></li>
<li><a href="#org479195f">69. Antibiotics – classification; mechanisms, type of  ** action.and antimicrobial spectrum.</a></li>
<li><a href="#org404aac7">Principles of the rational antibiotic therapy and prophylaxis.</a></li>
<li><a href="#org462ef2c">70. Penicillins.</a></li>
<li><a href="#org2fe28fb">71. Cephalosporins.</a></li>
<li><a href="#org68ff409">72. Carbapenems and monobactams. Glycopeptides.</a></li>
<li><a href="#orge5d2ff6">73. Aminoglycosides.</a></li>
<li><a href="#orgc02849b">74. Tetracyclines.</a></li>
<li><a href="#org75fce53">75. Macrolides and ketolides.</a></li>
<li><a href="#org78a2bce">76. Lincosamides. Amphenicols.</a></li>
<li><a href="#org5c33cfc">77. Sulfanoamides.</a></li>
<li><a href="#org92c3811">78. Quinolones.</a></li>
<li><a href="#org412dbe9">79. Antituberculosis drugs. Antileprosy drugs.</a></li>
<li><a href="#orgc541fa3">80. Antimycotics.</a></li>
<li><a href="#orge07f6c2">81. Antiviral drugs.</a></li>
<li><a href="#org0a58653">82. Antiprotozoal drugs.</a></li>
<li><a href="#org2420ff7">83. Antihelmintic drugs.</a></li>
<li><a href="#orgc551f69">84. Antiseptics and disinfectants.</a></li>
<li><a href="#org72f9451">85. Antitumor chemotherapeuticals.</a></li>
<li><a href="#org7336d6b">86. Hormonal antitumor drugs. Target antitumor drugs.</a></li>
<li><a href="#org7f40ff6">87. Immunomodulators.</a></li>
</ul>
</li>
<li><a href="#org1380ef1"><span class="todo TODO">TODO</span> DRUG TOXICOLOGY</a>
<ul>
<li><a href="#orga6d17e6">88. Side effects of drugs.</a></li>
<li><a href="#org184c396">89. Organ toxic effects of drugs.</a></li>
<li><a href="#org3759e6e">90. Fetal damage caused by drugs.</a></li>
<li><a href="#org6f08637">91. Principles of reatment of acute drug poisoning.</a></li>
<li><a href="#org0784917">92. Antidotes.</a></li>
<li><a href="#orga69db70">93. Acute intoxication and abuse of opioids. Principles of the treatment.</a></li>
<li><a href="#org5ff0f40">94. Acute intoxication and abuse of benzodiazepines. Principles of the treatment.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1f26c3c" class="outline-2">
<h2 id="org1f26c3c"><a href="https://thanosapollo.com">Home Page</a></h2>
</div>
<div id="outline-container-org5781be0" class="outline-2">
<h2 id="org5781be0">GENERAL PHARMACOLOGY</h2>
<div class="outline-text-2" id="text-org5781be0">
</div>
<div id="outline-container-org5942ef5" class="outline-3">
<h3 id="org5942ef5">1. Object and branches of pharmacology. Connection with other sciences. Historical review. Sourses of drugs.</h3>
<div class="outline-text-3" id="text-org5942ef5">
</div>
<div id="outline-container-orgc6f7ec2" class="outline-4">
<h4 id="orgc6f7ec2">Object and branches of pharmacology</h4>
<div class="outline-text-4" id="text-orgc6f7ec2">
<p>
Pharmacology is the study of drugs and their effects on living organisms. It is a branch of biomedical science that deals with the discovery, development, and evaluation of drugs and their therapeutic uses.
There are two main branches of pharmacology: <b>pharmacokinetics</b> and <b>pharmacodynamics</b>
</p>

<ul class="org-ul">
<li>Pharmacokinetics deals with the absorption, distribution, metabolism, and excretion of drugs in the body.
<ul class="org-ul">
<li>This includes the study of how drugs are absorbed into the bloodstream, how they are distributed to various organs and tissues, how they are metabolized or broken down, and how they are eliminated from the body.</li>
</ul></li>

<li>Pharmacodynamics, on the other hand, deals with the effects of drugs on the body
<ul class="org-ul">
<li>This includes their mechanisms of action, therapeutic and toxic effects, and interactions with other drugs and with physiological systems.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org56a29bc" class="outline-4">
<h4 id="org56a29bc">Connetion with other sciences</h4>
<div class="outline-text-4" id="text-org56a29bc">
<p>
Pharmacology is closely connected with other sciences such as chemistry, biochemistry, physiology, and pathology.
</p>
<ul class="org-ul">
<li>Chemists are involved in the discovery and synthesis of new drugs, while biochemists study the biochemical mechanisms of drug action.</li>
<li>Physiologists study the effects of drugs on the body, while pathologists study the effects of diseases on the body and how drugs can be used to treat them.</li>
</ul>
</div>
</div>
<div id="outline-container-org0af816d" class="outline-4">
<h4 id="org0af816d">Historical review</h4>
<div class="outline-text-4" id="text-org0af816d">
<ul class="org-ul">
<li>The history of pharmacology can be traced back to ancient times, when people used natural remedies such as herbs and plants to treat illnesses.</li>
<li>The ancient Egyptians, Greeks, and Chinese all developed their own systems of medicine based on natural remedies.</li>
</ul>
</div>
</div>
