Pharmacology.html
<div id="outline-container-org2e8f329" class="outline-4">
<h4 id="org2e8f329">Sources of drugs</h4>
<div class="outline-text-4" id="text-org2e8f329">
<ul class="org-ul">
<li>In modern times, the discovery of new drugs has been largely driven by advances in chemistry and biochemistry.</li>
<li>Many of the drugs used today are synthesized in laboratories, rather than being derived from natural sources.</li>
<li>However, natural products such as plants and animals still remain an important source of drugs.
<ul class="org-ul">
<li>For example, the anti-cancer drug Taxol(paclitaxel) was originally isolated from the bark of the Pacific yew tree, and the painkiller morphine is derived from the opium poppy.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaad18a8" class="outline-4">
<h4 id="orgaad18a8">Summary</h4>
<div class="outline-text-4" id="text-orgaad18a8">
<p>
In summary, pharmacology is a branch of biomedical science that deals with the study of drugs and their effects on living organisms.
It has two main branches: pharmacokinetics and pharmacodynamics, and is closely connected with other sciences such as chemistry, biochemistry, physiology, and pathology.
The history of pharmacology can be traced back to ancient times, and the discovery of new drugs is still largely driven by advances in chemistry and biochemistry, although natural products remain an important source of drugs.
</p>
</div>
</div>
</div>
<div id="outline-container-org54b5c31" class="outline-3">
<h3 id="org54b5c31">2. Drug - definition, origin, nomenclature. Drug form and drug product - definition. Drug preparations.</h3>
<div class="outline-text-3" id="text-org54b5c31">
<ul class="org-ul">
<li>A drug is a substance that is used to treat, prevent, diagnose, or alleviate symptoms of a disease or medical condition.</li>
<li>Drugs can be administered in various forms, including tablets, capsules, liquids, creams, ointments, and injectables. They can be derived from natural sources, synthesized in a laboratory, or a combination of both.</li>
</ul>
</div>
<div id="outline-container-org79f2def" class="outline-4">
<h4 id="org79f2def">Defintion, origin and nomenclature</h4>
<div class="outline-text-4" id="text-org79f2def">
<ul class="org-ul">
<li>The term "drug" comes from the Dutch word "droog," which means "dry," and originally referred to dried herbs or plants used for medicinal purposes.
<ul class="org-ul">
<li>Over time, the term came to encompass any substance that was used for therapeutic purposes, and later, for recreational or performance-enhancing purposes as well.</li>
</ul></li>

<li>Nomenclature is the system of naming and classifying drugs.</li>
</ul>
<p>
Drugs can be classified based on their chemical structure, mechanism of action, or therapeutic use.
Generic names are the official names of drugs and are often based on their chemical structure.
</p>
<ul class="org-ul">
<li>For example, the generic name for the popular painkiller Advil is ibuprofen.</li>
</ul>

<p>
In addition to generic names, drugs may also have brand names or trade names, which are typically chosen by the pharmaceutical company that produces and markets them.
Brand names can be used to identify the manufacturer and may also help to distinguish different formulations of the same drug.
</p>
<ul class="org-ul">
<li>For example, the generic drug fluoxetine is sold under the brand name Prozac.</li>
</ul>
</div>
</div>
<div id="outline-container-orge7622a5" class="outline-4">
<h4 id="orge7622a5">Drug form and drug product</h4>
<div class="outline-text-4" id="text-orge7622a5">
<p>
A drug form is the physical form in which a drug is prepared for administration.
</p>
<ul class="org-ul">
<li>For example, tablets, capsules, liquids, and injectables are all different drug forms.</li>
<li>The choice of drug form can depend on a variety of factors, including the desired route of administration, the patient's preference, and the properties of the drug itself.</li>

<li>A drug product, on the other hand, is a specific formulation of a drug that is intended for use in humans or animals.
<ul class="org-ul">
<li>A drug product typically contains one or more active ingredients, as well as excipients, which are inactive ingredients used to improve the stability, solubility, or other properties of the drug.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org832b61c" class="outline-4">
<h4 id="org832b61c">Drug preparations</h4>
<div class="outline-text-4" id="text-org832b61c">
<p>
Drug preparations are the different methods used to prepare a drug product.
</p>
<ul class="org-ul">
<li>These may include compounding, which involves the preparation of a drug product by a pharmacist or other healthcare professional, as well as the manufacturing of drugs by pharmaceutical companies.</li>
<li>Drug preparations may also involve the use of specialized equipment and techniques, such as aseptic processing or lyophilization, which are used to prepare sterile or stable drug products.</li>
</ul>
</div>
</div>
<div id="outline-container-org7c6b6c9" class="outline-4">
<h4 id="org7c6b6c9">Summary</h4>
<div class="outline-text-4" id="text-org7c6b6c9">
<ul class="org-ul">
<li>In summary, a drug is a substance used for therapeutic, preventative, diagnostic or symptom-alleviating purposes. Drugs can be administered in various forms, and can be derived from natural sources, synthesized in a laboratory, or a combination of both.</li>
<li>The nomenclature of drugs can vary depending on the context, and drugs can have generic names, brand names, or trade names.</li>
<li>Drug forms and drug products are different concepts in pharmacology, with drug forms referring to the physical form in which a drug is prepared for administration, and drug products referring to the specific formulation of a drug that is intended for use in humans or animals.</li>
<li>Drug preparations are the different methods used to prepare a drug product.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf547a6d" class="outline-3">
<h3 id="orgf547a6d">3. Drug development - stages and phases.</h3>
<div class="outline-text-3" id="text-orgf547a6d">
<p>
Drug development is a complex process that involves several stages and phases, including preclinical testing, clinical trials, and regulatory approval. Here are the main stages and phases of drug development:
</p>

<ul class="org-ul">
<li>Discovery and Preclinical Testing: This stage involves the identification of potential drug candidates and their preclinical testing, which includes laboratory and animal studies.
<ul class="org-ul">
<li>Preclinical testing is done to determine the safety and efficacy of the drug candidate, as well as to determine its pharmacokinetic and pharmacodynamic properties.</li>
</ul></li>

<li>Investigational New Drug (IND) Application: After preclinical testing is completed and the drug candidate shows promise, an IND application is submitted to regulatory authorities such as the FDA in the United States.
<ul class="org-ul">
<li>The IND application includes data from preclinical testing, as well as a plan for clinical trials.</li>
</ul></li>

<li>Clinical Trials: Clinical trials involve testing the drug candidate in humans to determine its safety and efficacy.
<ul class="org-ul">
<li>Clinical trials are typically divided into three phases:

<ul class="org-ul">
<li>Phase I: In this phase, the drug candidate is tested in a small group of healthy volunteers to determine its safety, dosage range, and pharmacokinetic properties.</li>

<li>Phase II: In this phase, the drug candidate is tested in a larger group of patients to determine its effectiveness and further evaluate its safety.</li>

<li>Phase III: In this phase, the drug candidate is tested in an even larger group of patients to confirm its effectiveness and monitor its side effects.</li>
</ul></li>
</ul></li>

<li>New Drug Application (NDA): If the results of the clinical trials are positive, an NDA is submitted to regulatory authorities such as the FDA. The NDA includes data from the clinical trials, as well as information on the drug's manufacturing, stability, and labeling.</li>

<li>Regulatory Approval: If the regulatory authorities approve the NDA, the drug is allowed to be marketed and sold to the public. Regulatory authorities may also require post-marketing surveillance to monitor the drug's safety and effectiveness.</li>
</ul>
</div>
<div id="outline-container-orgbdc3845" class="outline-4">
<h4 id="orgbdc3845">Summary</h4>
<div class="outline-text-4" id="text-orgbdc3845">
<p>
In summary, drug development involves several stages and phases, including discovery and preclinical testing, an IND application, clinical trials (Phase I, II, and III), an NDA, and regulatory approval.
</p>
<ul class="org-ul">
<li>The entire process can take several years and involves significant investment of time and resources.</li>
</ul>
</div>
</div>
</div>
