Pharmacology.html

<div id="outline-container-orga71f315" class="outline-3">
<h3 id="orga71f315">16. Pharmaceutical drug interactions (drug incompatibility).   Drugs affecting clinical  laboratory tests. Interactions of drugs with foods.</h3>
<div class="outline-text-3" id="text-orga71f315">
<p>
Pharmaceutical drug interactions, also known as drug incompatibility, occur when two or more drugs are combined and interact with each other in a way that alters their therapeutic effect or increases the risk of adverse effects. Here are some examples of pharmaceutical drug interactions:
</p>

<ul class="org-ul">
<li>Drug-drug interactions: Interactions can occur when two or more drugs are taken together and affect their absorption, distribution, metabolism, or elimination. This can lead to changes in drug concentrations and potential toxicity.</li>
<li>Drug-disease interactions: Interactions can occur when a drug is used in a patient with a particular disease or condition, leading to changes in drug efficacy or potential adverse effects.</li>
<li>Drug-allergy interactions: Interactions can occur when a patient is allergic to a drug or its components, leading to allergic reactions or other adverse effects.</li>
<li>Drug-laboratory interactions: Interactions can occur when a drug affects the results of clinical laboratory tests, leading to inaccurate or misleading results. For example, certain drugs can affect the levels of enzymes, electrolytes, or blood glucose, leading to false-positive or false-negative results.</li>
<li>Drug-food interactions: Interactions can occur when a drug interacts with certain foods or dietary supplements, leading to changes in drug absorption, distribution, metabolism, or elimination. For example, some drugs should not be taken with grapefruit juice because it can increase the drug's concentration in the body and increase the risk of toxicity.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge53e39c" class="outline-2">
<h2 id="orge53e39c"><span class="todo TODO">TODO</span> PHARMACOLOGY OF ORGAN SYSTEMS</h2>
<div class="outline-text-2" id="text-orge53e39c">
</div>
<div id="outline-container-org2507c2b" class="outline-3">
<h3 id="org2507c2b">17. Pharmacological modulation of the cholinergic   ** neurotransmission – levels and</h3>
</div>
<div id="outline-container-org88c6ecf" class="outline-3">
<h3 id="org88c6ecf">mechanisms.</h3>
</div>
<div id="outline-container-orgc436642" class="outline-3">
<h3 id="orgc436642">18. Cholinergic drugs (cholinomimetics).</h3>
</div>
<div id="outline-container-org4efe15c" class="outline-3">
<h3 id="org4efe15c">19. Antimuscarinic drugs (M-cholinolytics).</h3>
</div>
<div id="outline-container-orgddccb0e" class="outline-3">
<h3 id="orgddccb0e">20. Neuromuscular blockers (Peripheral muscle relaxants).</h3>
</div>
<div id="outline-container-org103b9b9" class="outline-3">
<h3 id="org103b9b9">21. Pharmacological modulation of the adrenergic   ** neurotransmission – levels and</h3>
</div>
<div id="outline-container-org4d9b08f" class="outline-3">
<h3 id="org4d9b08f">mechanisms.</h3>
</div>
<div id="outline-container-orgd8685e5" class="outline-3">
<h3 id="orgd8685e5">22. Adrenomimetics.</h3>
</div>
<div id="outline-container-org9e3c67a" class="outline-3">
<h3 id="org9e3c67a">23. Alpha-adrenergic blocking agents. Agonists of the  ** central presynaptic α2a-adrenergic</h3>
</div>
<div id="outline-container-org41475b0" class="outline-3">
<h3 id="org41475b0">receptors.</h3>
</div>
<div id="outline-container-org2cc8ce5" class="outline-3">
<h3 id="org2cc8ce5">24. Beta-adrenergic blocking agents.</h3>
</div>
<div id="outline-container-orgf0ebaac" class="outline-3">
<h3 id="orgf0ebaac">25. Histamine antagonists.</h3>
</div>
<div id="outline-container-org869faef" class="outline-3">
<h3 id="org869faef">26. Serotonin agonists and antiserotoninergic drugs.</h3>
</div>
<div id="outline-container-orgc6474eb" class="outline-3">
<h3 id="orgc6474eb">27. Local anaesthetics.</h3>
</div>
<div id="outline-container-orgf636c94" class="outline-3">
<h3 id="orgf636c94">28. General anaesthetics.</h3>
</div>
<div id="outline-container-orgf57e60e" class="outline-3">
<h3 id="orgf57e60e">29. Hypnotics. Sedative drugs with plant origin.</h3>
</div>
<div id="outline-container-org39df9c5" class="outline-3">
<h3 id="org39df9c5">30. Antiepileptic drugs.</h3>
</div>
<div id="outline-container-org1dd1531" class="outline-3">
<h3 id="org1dd1531">31. Antiparkinsonian drugs.</h3>
</div>
<div id="outline-container-orgf880b95" class="outline-3">
<h3 id="orgf880b95">32. Neuroleptics.</h3>
</div>
<div id="outline-container-org50ace7a" class="outline-3">
<h3 id="org50ace7a">33. Anxiolytics. Muscle relaxants with central action.</h3>
</div>
<div id="outline-container-org023be74" class="outline-3">
<h3 id="org023be74">34. Antidepressants. Antimanic drugs.</h3>
</div>
<div id="outline-container-org1600b84" class="outline-3">
<h3 id="org1600b84">35. Psychostimulants. Nootropic drugs.</h3>
</div>
<div id="outline-container-orgc33f7ef" class="outline-3">
<h3 id="orgc33f7ef">36. Opioid analgesics.</h3>
</div>
<div id="outline-container-orgb6f6cb2" class="outline-3">
<h3 id="orgb6f6cb2">37. Nonsteroidal anti-inflammatory drugs. Non-opioid  ** analgesics.</h3>
</div>
<div id="outline-container-org0a0f0a8" class="outline-3">
<h3 id="org0a0f0a8">38. Calcium channel blockers.</h3>
</div>
<div id="outline-container-org09e520e" class="outline-3">
<h3 id="org09e520e">39. Drugs that affect the renin-angiotensin-aldosterone ** system.</h3>
</div>
<div id="outline-container-org0464004" class="outline-3">
<h3 id="org0464004">40. Antihypertensive drugs.</h3>
</div>
<div id="outline-container-orgc66ef62" class="outline-3">
<h3 id="orgc66ef62">41. Antiarrhythmic drugs.</h3>
</div>
<div id="outline-container-org48d9b2c" class="outline-3">
<h3 id="org48d9b2c">42. Antianginal (antistenocardial) drugs.</h3>
</div>
<div id="outline-container-org9e4444d" class="outline-3">
<h3 id="org9e4444d">43. Drugs for the treatment of heart failure.</h3>
</div>
<div id="outline-container-org823f97d" class="outline-3">
<h3 id="org823f97d">44. Diuretics.</h3>
</div>
<div id="outline-container-org8a5b064" class="outline-3">
<h3 id="org8a5b064">45. Peripheral vasodilators. Capillarotonic and venotonic  ** drugs.</h3>
</div>
<div id="outline-container-org944a77e" class="outline-3">
<h3 id="org944a77e">46. Antimigraine drugs.</h3>
</div>
<div id="outline-container-org71b6c1f" class="outline-3">
<h3 id="org71b6c1f">47. Antidyslipidemic drugs.</h3>
</div>
<div id="outline-container-org9ccdb0b" class="outline-3">
<h3 id="org9ccdb0b">48. Haematopoietic drugs.</h3>
</div>
<div id="outline-container-org380fb47" class="outline-3">
<h3 id="org380fb47">49. Haemostatics (antiheamorrhagic) drugs.</h3>
</div>
<div id="outline-container-org81a8025" class="outline-3">
<h3 id="org81a8025">50. Anticoagulants.</h3>
</div>
<div id="outline-container-orgec71eab" class="outline-3">
<h3 id="orgec71eab">51. Fibrinolytics. Antiplatelet drugs.</h3>
</div>
<div id="outline-container-org0cee9ad" class="outline-3">
<h3 id="org0cee9ad">52. Antiasthmatic drugs.</h3>
</div>
<div id="outline-container-org9f96e6c" class="outline-3">
<h3 id="org9f96e6c">53. Antitussive drugs.</h3>
</div>
<div id="outline-container-org582acb0" class="outline-3">
<h3 id="org582acb0">54. Antiulcer drugs.</h3>
</div>
<div id="outline-container-org15d3730" class="outline-3">
<h3 id="org15d3730">55. Antiemetic drugs.</h3>
</div>
<div id="outline-container-orgf774cc5" class="outline-3">
<h3 id="orgf774cc5">56. Hepatoprotectors. Drugs that affect bile secretion.  ** Pancreatic enzyme preparations.</h3>
</div>
<div id="outline-container-orgb6eb73b" class="outline-3">
<h3 id="orgb6eb73b">57. Laxative drugs.</h3>
</div>
<div id="outline-container-orgced6ed5" class="outline-3">
<h3 id="orgced6ed5">58. Antidiarrheal drugs.</h3>
</div>
<div id="outline-container-org1d48382" class="outline-3">
<h3 id="org1d48382">59. Vitamins – clinical applications.</h3>
</div>
<div id="outline-container-org0404197" class="outline-3">
<h3 id="org0404197">60. Drugs that affect calcium and phosphorus exchange.  ** Antigout drugs.</h3>
</div>
<div id="outline-container-orgea77393" class="outline-3">
<h3 id="orgea77393">61. Hypothalamic and pituitary hormones – drugs and clinical  application.</h3>
</div>
<div id="outline-container-org1407194" class="outline-3">
<h3 id="org1407194">62. Thyreoactive drugs.</h3>
</div>
<div id="outline-container-org2d13271" class="outline-3">
<h3 id="org2d13271">63. Insulins and insulin analogues.</h3>
</div>
<div id="outline-container-org5c16804" class="outline-3">
<h3 id="org5c16804">64. Oral antidiabetic drugs.</h3>
</div>
<div id="outline-container-org2a979fa" class="outline-3">
<h3 id="org2a979fa">65. Glucocorticoids and mineralcorticoids.</h3>
</div>
<div id="outline-container-org892957d" class="outline-3">
<h3 id="org892957d">66. Female sex hormones – drugs and clinical application.  ** Hormonal contraceptives.</h3>
</div>
<div id="outline-container-org9cfee68" class="outline-3">
<h3 id="org9cfee68">67. Male sex hormones – drugs and clinical application.  ** Anabolic drugs. Drugs for the</h3>
</div>
<div id="outline-container-org6c65166" class="outline-3">
<h3 id="org6c65166">treatment of erectile dysfunction.</h3>
</div>
<div id="outline-container-org9da502d" class="outline-3">
<h3 id="org9da502d">68. Uteroactive drugs.</h3>
</div>
<div id="outline-container-org479195f" class="outline-3">
<h3 id="org479195f">69. Antibiotics – classification; mechanisms, type of  ** action.and antimicrobial spectrum.</h3>
</div>
<div id="outline-container-org404aac7" class="outline-3">
<h3 id="org404aac7">Principles of the rational antibiotic therapy and prophylaxis.</h3>
</div>
<div id="outline-container-org462ef2c" class="outline-3">
<h3 id="org462ef2c">70. Penicillins.</h3>
</div>
<div id="outline-container-org2fe28fb" class="outline-3">
<h3 id="org2fe28fb">71. Cephalosporins.</h3>
</div>
<div id="outline-container-org68ff409" class="outline-3">
<h3 id="org68ff409">72. Carbapenems and monobactams. Glycopeptides.</h3>
</div>
<div id="outline-container-orge5d2ff6" class="outline-3">
<h3 id="orge5d2ff6">73. Aminoglycosides.</h3>
</div>
<div id="outline-container-orgc02849b" class="outline-3">
<h3 id="orgc02849b">74. Tetracyclines.</h3>
</div>
<div id="outline-container-org75fce53" class="outline-3">
<h3 id="org75fce53">75. Macrolides and ketolides.</h3>
</div>
<div id="outline-container-org78a2bce" class="outline-3">
<h3 id="org78a2bce">76. Lincosamides. Amphenicols.</h3>
</div>
<div id="outline-container-org5c33cfc" class="outline-3">
<h3 id="org5c33cfc">77. Sulfanoamides.</h3>
</div>
<div id="outline-container-org92c3811" class="outline-3">
<h3 id="org92c3811">78. Quinolones.</h3>
</div>
<div id="outline-container-org412dbe9" class="outline-3">
<h3 id="org412dbe9">79. Antituberculosis drugs. Antileprosy drugs.</h3>
</div>
<div id="outline-container-orgc541fa3" class="outline-3">
<h3 id="orgc541fa3">80. Antimycotics.</h3>
</div>
<div id="outline-container-orge07f6c2" class="outline-3">
<h3 id="orge07f6c2">81. Antiviral drugs.</h3>
</div>
