content/pharmacology.org
**  82. Antiprotozoal drugs.
**  83. Antihelmintic drugs.
**  84. Antiseptics and disinfectants.
**  85. Antitumor chemotherapeuticals.
**  86. Hormonal antitumor drugs. Target antitumor drugs.
**  87. Immunomodulators. 
* TODO DRUG TOXICOLOGY
** 88. Side effects of drugs.
** 89. Organ toxic effects of drugs.
** 90. Fetal damage caused by drugs.
** 91. Principles of reatment of acute drug poisoning.
** 92. Antidotes.
** 93. Acute intoxication and abuse of opioids. Principles of the treatment.
** 94. Acute intoxication and abuse of benzodiazepines. Principles of the treatment.        
