Pharmacology.html
<div id="outline-container-org0a58653" class="outline-3">
<h3 id="org0a58653">82. Antiprotozoal drugs.</h3>
</div>
<div id="outline-container-org2420ff7" class="outline-3">
<h3 id="org2420ff7">83. Antihelmintic drugs.</h3>
</div>
<div id="outline-container-orgc551f69" class="outline-3">
<h3 id="orgc551f69">84. Antiseptics and disinfectants.</h3>
</div>
<div id="outline-container-org72f9451" class="outline-3">
<h3 id="org72f9451">85. Antitumor chemotherapeuticals.</h3>
</div>
<div id="outline-container-org7336d6b" class="outline-3">
<h3 id="org7336d6b">86. Hormonal antitumor drugs. Target antitumor drugs.</h3>
</div>
<div id="outline-container-org7f40ff6" class="outline-3">
<h3 id="org7f40ff6">87. Immunomodulators.</h3>
</div>
</div>
<div id="outline-container-org1380ef1" class="outline-2">
<h2 id="org1380ef1"><span class="todo TODO">TODO</span> DRUG TOXICOLOGY</h2>
<div class="outline-text-2" id="text-org1380ef1">
</div>
<div id="outline-container-orga6d17e6" class="outline-3">
<h3 id="orga6d17e6">88. Side effects of drugs.</h3>
</div>
<div id="outline-container-org184c396" class="outline-3">
<h3 id="org184c396">89. Organ toxic effects of drugs.</h3>
</div>
<div id="outline-container-org3759e6e" class="outline-3">
<h3 id="org3759e6e">90. Fetal damage caused by drugs.</h3>
</div>
<div id="outline-container-org6f08637" class="outline-3">
<h3 id="org6f08637">91. Principles of reatment of acute drug poisoning.</h3>
</div>
<div id="outline-container-org0784917" class="outline-3">
<h3 id="org0784917">92. Antidotes.</h3>
</div>
<div id="outline-container-orga69db70" class="outline-3">
<h3 id="orga69db70">93. Acute intoxication and abuse of opioids. Principles of the treatment.</h3>
</div>
<div id="outline-container-org5ff0f40" class="outline-3">
<h3 id="org5ff0f40">94. Acute intoxication and abuse of benzodiazepines. Principles of the treatment.</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
